<a href="https://colab.research.google.com/github/Sadiksha08/FDS-Lab-Work/blob/main/Lab1_Assignment1_Sadiksha_Singh.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#Mounting Google Drive
%cd ..
from google.colab import drive
drive.mount('/content/gdrive')

/
Mounted at /content/gdrive

In [3]:
import numpy 
import pandas as pd

In [4]:
# 1. Creating a csv file

#import pandas as pd
Location = "/content/gdrive/MyDrive/EmpData.csv"
EmpId = ['E101', 'E102', 'E103', 'E104']
FName = ['Shweta','Manisha','Madhu','Anita']
LName = ['Subnis','Perdesi','Mali','Rai']
Designation = ['ProjectEngineer','Tester','SrSoftwareEngineer','WebDeveloper']
Basic_Salary = [40000, 50000, 60000, 70000]

EmpData = zip(EmpId,FName,LName,Designation,Basic_Salary)
column = ['EmpId','FName','LName','Designation','Basic Salary']

df = pd.DataFrame(data = EmpData, columns = column)
df.to_csv(Location, index=False)

# Loading data from csv file and displaying data with headers
df = pd.read_csv(Location)
df

  EmpId    FName    LName         Designation  Basic Salary
0  E101   Shweta   Subnis     ProjectEngineer         40000
1  E102  Manisha  Perdesi              Tester         50000
2  E103    Madhu     Mali  SrSoftwareEngineer         60000
3  E104    Anita      Rai        WebDeveloper         70000

In [5]:
# Reading the file

open("/content/gdrive/MyDrive/EmpData.csv").read()

'EmpId,FName,LName,Designation,Basic Salary\nE101,Shweta,Subnis,ProjectEngineer,40000\nE102,Manisha,Perdesi,Tester,50000\nE103,Madhu,Mali,SrSoftwareEngineer,60000\nE104,Anita,Rai,WebDeveloper,70000\n'

In [6]:
# Loading data from csv file and displaying data without headers

Location = "/content/gdrive/MyDrive/EmpData.csv"
df = pd.read_csv(Location, header = None)
df

       0        1        2                   3             4
0  EmpId    FName    LName         Designation  Basic Salary
1   E101   Shweta   Subnis     ProjectEngineer         40000
2   E102  Manisha  Perdesi              Tester         50000
3   E103    Madhu     Mali  SrSoftwareEngineer         60000
4   E104    Anita      Rai        WebDeveloper         70000

In [7]:
pip install xlsxwriter

Collecting xlsxwriter
  Downloading https://files.pythonhosted.org/packages/6b/41/bf1aae04932d1eaffee1fc5f8b38ca47bbbf07d765129539bc4bcce1ce0c/XlsxWriter-1.3.7-py2.py3-none-any.whl (144kB)
     |████████████████████████████████| 153kB 9.0MB/s
Installing collected packages: xlsxwriter
Successfully installed xlsxwriter-1.3.7

In [8]:
import xlsxwriter

Location = "/content/gdrive/MyDrive/EmpData.xlsx"

In [9]:
# creating excel file
Location = "/content/gdrive/MyDrive/EmpData.xlsx"
EmpId = ['E101', 'E102', 'E103', 'E104']
FName = ['Shweta','Manisha','Madhu','Anita']
LName = ['Subnis','Perdesi','Mali','Rai']
Designation = ['ProjectEngineer','Tester','SrSoftwareEngineer','WebDeveloper']
Basic_Salary = [40000, 50000, 60000, 70000]
EmployeeData = zip(EmpId,FName,LName,Designation,Basic_Salary)
column = ['Emp_Id','F_Name','L_Name','Designation','Basic_Sal']
new_df = pd.DataFrame(data = EmployeeData, columns = column)

writer = pd.ExcelWriter(Location, engine='xlsxwriter')
new_df.to_excel(writer, sheet_name='Sheet1')
writer.save()

# Loading data from excel file and displaying data with headers
Location = "/content/gdrive/MyDrive/EmpData.xlsx"
new_df = pd.read_excel(Location, index_col=0)
new_df

  Emp_Id   F_Name   L_Name         Designation  Basic_Sal
0   E101   Shweta   Subnis     ProjectEngineer      40000
1   E102  Manisha  Perdesi              Tester      50000
2   E103    Madhu     Mali  SrSoftwareEngineer      60000
3   E104    Anita      Rai        WebDeveloper      70000

In [10]:
# creating a SQL database file 
import os
import sqlite3 as lite
import pandas as pd

EmpId = ['E101', 'E102', 'E103', 'E104']
FName = ['Shweta','Manisha','Madhu','Anita']
LName = ['Subnis','Perdesi','Mali','Rai']
Designation = ['ProjectEngineer','Tester','SrSoftwareEngineer','WebDeveloper']
Basic_Salary = [40000, 50000, 60000, 70000]
EmployeeData_2 = zip(EmpId,FName,LName,Designation,Basic_Salary)
column = ['EmpId','FName','LName','Designation','Basic Salary']
new_df2 = pd.DataFrame(data = EmployeeData_2, columns = column)
db_employee = r'//content/gdrive/MyDrive/EmpData.db'
con = lite.connect(db_employee)
new_df2.to_sql('Empdata',
con,
schema=None,
if_exists='replace',
index=False,
index_label=None,
chunksize=None,
dtype=None)
con.close()

/usr/local/lib/python3.6/dist-packages/pandas/core/generic.py:2615: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [11]:
# Connect to sqlite db
import pandas as pd
from sqlalchemy import create_engine
db_file = r'/content/gdrive/MyDrive/EmpData.db'
engine = create_engine(r"sqlite:///{}" .format(db_file))
sql = 'SELECT * from EmpData'
new_df2 = pd.read_sql(sql, engine)
new_df2

  EmpId    FName    LName         Designation  Basic Salary
0  E101   Shweta   Subnis     ProjectEngineer         40000
1  E102  Manisha  Perdesi              Tester         50000
2  E103    Madhu     Mali  SrSoftwareEngineer         60000
3  E104    Anita      Rai        WebDeveloper         70000